brew 'ghq'
brew 'git'
brew 'jq'
brew 'mas'
brew 'openssl'
brew 'peco'
brew 'shellcheck'
brew 'tig'
brew 'tree'
brew 'zsh'
brew 'anyenv'
brew 'yarn'
brew 'awscli'
brew 'fzy' # for enhanced

tap 'microsoft/git'
cask 'git-credential-manager-core'

cask '1password'
cask 'alfred'
cask 'dash'
cask 'deepl'
cask 'docker'
cask 'drawio'
cask 'gyazo'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'kindle'
cask 'notion'
cask 'rectangle'
cask 'skitch'
cask 'slack'
cask 'todoist'
cask 'visual-studio-code'
cask 'xmind'

mas 'GoodNotes 5', id: 1444383602
