# Taps
tap 'xykong/tap'

# CLI tools
brew 'chezmoi'
brew 'eza'
brew 'ghq'
brew 'git'
brew 'gh'
brew 'jq'
brew 'mas'
brew 'mise'
brew 'shellcheck'
brew 'starship'
brew 'fzf'
brew 'awscli'
brew 'kubernetes-cli'
brew 'tmux'
brew 'uv'
cask '1password-cli'

# Applications
cask '1password'
cask 'antinote'
cask 'arc'
cask 'chatgpt'
cask 'claude'
cask 'cleanshot'
cask 'cmux'
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'dockdoor'
cask 'figma'
cask 'flux-markdown'
cask 'fork'
cask 'git-credential-manager'
cask 'nani'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'claude-code@latest'
cask 'codex'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas 'Kindle', id: 302584613
mas 'RunCat', id: 1429033973
