# CLI tools
brew 'chezmoi'
brew 'eza'
brew 'ghq'
brew 'git'
brew 'gh'
brew 'jq'
brew 'mas'
brew 'mise'
brew 'openssl'
brew 'shellcheck'
brew 'starship'
brew 'fzf'
brew 'tree'
brew 'zsh'
brew 'awscli'
cask '1password-cli'

# Applications
cask '1password'
cask 'arc'
cask 'cmux'
cask 'cursor'
cask 'docker'
cask 'ghostty'
cask 'git-credential-manager'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'todoist'
cask 'zoom'

# Fonts
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas 'RunCat', id: 1429033973
